app/controllers/users_controller.rb

  def edit
      if (self.current_user.id.to_s==params[:id])
      @user = User.find(params[:id])
---
SELECT * FROM `users` WHERE (`users`.`id` = 1) LIMIT 1

  def update
    @user = User.find(params[:id])

    respond_to do |format|
      if @user.update_attributes(params[:user])
---
SELECT * FROM `users` WHERE (`users`.`id` = 1) LIMIT 1
UPDATE `users` SET `updated_at` = '2010-06-23 10:09:00', `name` = 'kartik' WHERE `id` = 1